select Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД, Н_ВЕДОМОСТИ.ДАТА from Н_ВЕДОМОСТИ
right join Н_ТИПЫ_ВЕДОМОСТЕЙ on Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = Н_ВЕДОМОСТИ.ВЕД_ИД
where Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = 1 and Н_ВЕДОМОСТИ.ЧЛВК_ИД = 117219 and Н_ВЕДОМОСТИ.ЧЛВК_ИД = 117219;

select Н_ЛЮДИ.ОТЧЕСТВО, Н_ВЕДОМОСТИ.ИД, Н_СЕССИЯ.ЧЛВК_ИД from Н_ЛЮДИ
right join Н_СЕССИЯ  on Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
right join Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
where Н_ЛЮДИ.ФАМИЛИЯ < 'Соколов' and Н_ВЕДОМОСТИ.ДАТА = '2010-06-18';

-- https://stackoverflow.com/questions/3739808/no-operator-matches-the-given-name-and-argument-types-you-might-need-to-add-e
-- ссылка на статью которая помогла в дебаге 3 задания
select count(Н_УЧЕНИКИ.ИД) from Н_УЧЕНИКИ
join Н_ЛЮДИ on Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
group by Н_ЛЮДИ.ОТЧЕСТВО, Н_УЧЕНИКИ.ГРУППА
having Н_ЛЮДИ.ОТЧЕСТВО = '.' and Н_УЧЕНИКИ.ГРУППА = '3102';

select Н_ЛЮДИ.ОТЧЕСТВО, count(Н_ЛЮДИ.ОТЧЕСТВО) from Н_ЛЮДИ
join Н_УЧЕНИКИ on Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
join Н_ПЛАНЫ on Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
join Н_ОТДЕЛЫ on Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
group by Н_ЛЮДИ.ОТЧЕСТВО, Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ
having Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'ВТ' and count(Н_ЛЮДИ.ОТЧЕСТВО) > 10;

select Н_УЧЕНИКИ.ГРУППА, AVG(EXTRACT(year from age(Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ))) from Н_ЛЮДИ
join Н_УЧЕНИКИ on Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
group by Н_УЧЕНИКИ.ГРУППА
having AVG(EXTRACT(year from age(Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ))) < (
    select MAX(EXTRACT(year from age(Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ)))
    from Н_ЛЮДИ
    join Н_УЧЕНИКИ on Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
    group by Н_УЧЕНИКИ.ГРУППА
    having Н_УЧЕНИКИ.ГРУППА = '1100'
);

select Н_УЧЕНИКИ.ГРУППА, Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ОТЧЕСТВО from Н_УЧЕНИКИ
join Н_ЛЮДИ on Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
join Н_ПЛАНЫ on Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
join Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ on Н_ПЛАНЫ.НАПС_ИД = Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД
join Н_НАПР_СПЕЦ on Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД = Н_НАПР_СПЕЦ.ИД
join Н_ФОРМЫ_ОБУЧЕНИЯ on Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
group by Н_ПЛАНЫ.НОМЕР, Н_УЧЕНИКИ.ГРУППА, Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ОТЧЕСТВО, Н_НАПР_СПЕЦ.КОД_НАПРСПЕЦ, Н_УЧЕНИКИ.КОНЕЦ_ПО_ПРИКАЗУ,
    Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ
having Н_НАПР_СПЕЦ.КОД_НАПРСПЕЦ = '230101' and Н_УЧЕНИКИ.КОНЕЦ_ПО_ПРИКАЗУ > '2012-08-31'
    and Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная';

select count(Н_УЧЕНИКИ.ИД) from Н_УЧЕНИКИ
join Н_ВЕДОМОСТИ on Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
group by Н_ВЕДОМОСТИ.ОЦЕНКА
having Н_ВЕДОМОСТИ.ОЦЕНКА = '3';