select Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД, Н_ВЕДОМОСТИ.ДАТА from Н_ВЕДОМОСТИ
right join Н_ТИПЫ_ВЕДОМОСТЕЙ on Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = Н_ВЕДОМОСТИ.ВЕД_ИД
where Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = 1 and Н_ВЕДОМОСТИ.ЧЛВК_ИД = 117219 and Н_ВЕДОМОСТИ.ЧЛВК_ИД = 117219;

select Н_ЛЮДИ.ОТЧЕСТВО, Н_ВЕДОМОСТИ.ИД, Н_СЕССИЯ.ЧЛВК_ИД from Н_ЛЮДИ
right join Н_СЕССИЯ  on Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
right join Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
where Н_ЛЮДИ.ФАМИЛИЯ < 'Соколов' and Н_ВЕДОМОСТИ.ДАТА = '2010-06-18';

select count(Н_УЧЕНИКИ.ИД) from Н_УЧЕНИКИ
join Н_ЛЮДИ on Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
group by Н_ЛЮДИ.ОТЧЕСТВО
having Н_ЛЮДИ.ОТЧЕСТВО = '.';