with StudentAges as (
    select Н_УЧЕНИКИ.ГРУППА,
    EXTRACT(year from age(Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ)) as v_age
    from Н_ЛЮДИ
    join Н_УЧЕНИКИ on Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
),

MaxAge1100 as (
    select max(v_age) as max_v from StudentAges where ГРУППА = '1100'
)

select ГРУППА, avg(v_age) from StudentAges
group by ГРУППА
having avg(v_age) < (select max_v from maxAge1100);

select Н_УЧЕНИКИ.ГРУППА, Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ОТЧЕСТВО from Н_УЧЕНИКИ
join Н_ЛЮДИ on Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
join Н_ПЛАНЫ on Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
join Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ on Н_ПЛАНЫ.НАПС_ИД = Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД
join Н_НАПР_СПЕЦ on Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД = Н_НАПР_СПЕЦ.ИД
join Н_ФОРМЫ_ОБУЧЕНИЯ on Н_ПЛАНЫ.ФО_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
where Н_НАПР_СПЕЦ.КОД_НАПРСПЕЦ = '230101'
    and Н_УЧЕНИКИ.КОНЕЦ_ПО_ПРИКАЗУ > '2012-08-31'
    and Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная';

select count(distinct Н_УЧЕНИКИ.ИД) from Н_УЧЕНИКИ
where exists (
    select 1 from Н_ВЕДОМОСТИ
    where Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД and Н_ВЕДОМОСТИ.ОЦЕНКА = '3'
);